#!/bin/bash

# 获取参数 
# $n 来获取参数,$0 代表程序本身，$1-$9代表第一个参数到第九个参数，十以上的参数要用大括号 ${10}
# $* 代表的是命令中的所有参数，但是会把参数看成一个整体 "$0,$1,$2,$3,$4...$n"
# $@ 代表命令中的所有参数，但是会把参数区分对待 "$0","$1","$2"..."$n"
# $# 代表参数中的个数

echo "$0=$0"
echo "\$1=$1"
echo "\$2="$2


echo "\$*="$*
echo "\$@="$@
echo "\$#="$#

#每次逻动（删除）第一个参数
shift

echo "\$1=$1"
echo "\$@="$@

echo "========================================"
for i in $*
do
echo $i
done

echo "========================================"
for i in $@
do
echo $i
done

echo "========================================"
for i in "$@"
do
echo $i
done

echo "========================================"
for i in "$*"
do
echo $i
done
